MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F128L.atdf
      <value-group caption="Frame Sync Polarity bit (Framed SPI mode only)" name="SPI2CON__FRMPOL">
         <value caption="Frame pulse is active-high" name="" value="0x1" />
         <value caption="Frame pulse is active-low" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" name="SPI2CON__FRMSYNC">
         <value caption="Frame sync pulse input (Slave mode)" name="" value="0x1" />
         <value caption="Frame sync pulse output (Master mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="Framed SPI Support bit" name="SPI2CON__FRMEN">
         <value caption="Framed SPI support is enabled (SSx pin used as FSYNC input/output)" name="" value="0x1" />
         <value caption="Framed SPI support is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Receive Buffer Full Interrupt Mode bits" name="SPI3CON__SRXISEL">
         <value caption="Interrupt is generated when the buffer is full" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is full by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is not empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last word in the receive buffer is read (i.e. buffer is empty)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Interrupt Mode bits" name="SPI3CON__STXISEL">
         <value caption="Interrupt is generated when the buffer is not full (has one or more empty elements)" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is empty by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is completely empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last transfer is shifted out of SPISR and transmit operations are complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable SDI bit" name="SPI3CON__DISSDI">
         <value caption="SDI pin is not used by the SPI module (pin is controlled by PORT function)" name="" value="0x1" />
         <value caption="SDI pin is controlled by the SPI module" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Mode Enable bit" name="SPI3CON__MSTEN">
         <value caption="Master mode" name="" value="0x1" />
         <value caption="Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SPI3CON__CKP">
         <value caption="Idle state for clock is a high level; active state is a low level" name="" value="0x1" />
         <value caption="Idle state for clock is a low level; active state is a high level" name="" value="0x0" />
      </value-group>
      <value-group caption="Slave Select Enable bit" name="SPI3CON__SSEN">
         <value caption="SSx pin used for Slave mode" name="" value="0x1" />
         <value caption="SSx pin not used for Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Clock Edge Select bit" name="SPI3CON__CKE">
         <value caption="Serial output data changes on transition from active clock state to Idle clock state (see CKP bit)" name="" value="0x1" />
         <value caption="Serial output data changes on transition from Idle clock state to active clock state (see CKP bit)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Data Input Sample Phase bit (master mode only)" name="SPI3CON__SMP">
         <value caption="(Master mode) Input data sampled at end of data output time / (Slave mode) value is ignored" name="" value="0x1" />
         <value caption="(Master mode) Input data sampled at middle of data output time / (Slave mode) value is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="32/16-Bit Communication Select bits" name="SPI3CON__MODE32">
         <value caption="(AUDEN=1) 24-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame/(AUDEN=0) 32-bit Data" name="" value="0x3" />
         <value caption="(AUDEN=1) 32-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame/(AUDEN=0) 32-bit Data" name="" value="0x2" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 32-bit Channel/64-bit Frame/(AUDEN=0) 16-bit Data" name="" value="0x1" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 16-bit Channel/32-bit Frame/(AUDEN=0) 8-bit Data" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable SDOx pin bit" name="SPI3CON__DISSDO">
         <value caption="SDOx pin is not used by the module. Pin is controlled by associated PORT register" name="" value="0x1" />
         <value caption="SDOx pin is controlled by the module" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="SPI3CON__SIDL">
         <value caption="Discontinue operation when CPU enters in Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Peripheral On bit" name="SPI3CON__ON">
         <value caption="SPI Peripheral is enabled" name="" value="0x1" />
         <value caption="SPI Peripheral is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enhanced Buffer Enable bit" name="SPI3CON__ENHBUF">
         <value caption="Enhanced Buffer mode is enabled" name="" value="0x1" />
         <value caption="Enhanced Buffer mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Frame Sync Pulse Edge Select bit" name="SPI3CON__SPIFE">
         <value caption="Frame synchronization pulse coincides with the first bit clock" name="" value="0x1" />
         <value caption="Frame synchronization pulse precedes the first bit clock" name="" value="0x0" />
      </value-group>
